``` ─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.training-vm-eu[10] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-10.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[11] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-11.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[12] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-12.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[13] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-13.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[14] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-14.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[15] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-15.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[16] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-16.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[17] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-17.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[18] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-18.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[19] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-19.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[20] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-20.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[21] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-21.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[22] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-22.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[23] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-23.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[24] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-24.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[25] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-25.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[26] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-26.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[27] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-27.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[28] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-28.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[29] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-29.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[30] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-30.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[31] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-31.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[32] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-32.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[33] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-33.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[34] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-34.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[35] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-35.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[36] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-36.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[37] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-37.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[38] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-38.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # aws_route53_record.training-vm-eu[39] will be created
  + resource "aws_route53_record" "training-vm-eu" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gat-39.eu.training.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 3600
      + type            = "A"
      + zone_id         = "Z05016927AMHTHGB1IS2"
    }

  # openstack_compute_instance_v2.training-vm-eu[10] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-10.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[11] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-11.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[12] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-12.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[13] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-13.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[14] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-14.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[15] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-15.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[16] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-16.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[17] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-17.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[18] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-18.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[19] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-19.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[20] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-20.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[21] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-21.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[22] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-22.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[23] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-23.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[24] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-24.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[25] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-25.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[26] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-26.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[27] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-27.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[28] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-28.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[29] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-29.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[30] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-30.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[31] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-31.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[32] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-32.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[33] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-33.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[34] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-34.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[35] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-35.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[36] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-36.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[37] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-37.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[38] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-38.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[39] will be created
  + resource "openstack_compute_instance_v2" "training-vm-eu" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c4m16d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "gat"
      + name                = "gat-39.eu.training.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "egress",
          + "public-amqp",
          + "public-ping",
          + "public-web2",
        ]
      + stop_before_destroy = false
      + user_data           = (known after apply)

      + block_device {
          + boot_index            = 0
          + delete_on_termination = true
          + destination_type      = "volume"
          + source_type           = "image"
          + uuid                  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + volume_size           = 50
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "public"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # random_pet.training-vm-eu[10] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[11] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[12] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[13] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[14] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[15] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[16] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[17] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[18] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[19] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[20] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[21] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[22] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[23] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[24] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[25] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[26] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[27] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[28] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[29] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[30] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[31] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[32] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[33] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[34] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[35] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[36] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[37] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[38] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

  # random_pet.training-vm-eu[39] will be created
  + resource "random_pet" "training-vm-eu" {
      + id        = (known after apply)
      + keepers   = {
          + "image"  = "77c0bdfc-74bb-476d-9b21-33081402343e"
          + "region" = "eu"
        }
      + length    = 2
      + separator = "-"
    }

Plan: 90 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ training_dns-eu = [
      - [
          - "gat-0.eu.training.galaxyproject.eu",
          - "gat-1.eu.training.galaxyproject.eu",
          - "gat-2.eu.training.galaxyproject.eu",
          - "gat-3.eu.training.galaxyproject.eu",
          - "gat-4.eu.training.galaxyproject.eu",
          - "gat-5.eu.training.galaxyproject.eu",
          - "gat-6.eu.training.galaxyproject.eu",
          - "gat-7.eu.training.galaxyproject.eu",
          - "gat-8.eu.training.galaxyproject.eu",
          - "gat-9.eu.training.galaxyproject.eu",
        ],
      + [
          + "gat-0.eu.training.galaxyproject.eu",
          + "gat-1.eu.training.galaxyproject.eu",
          + "gat-2.eu.training.galaxyproject.eu",
          + "gat-3.eu.training.galaxyproject.eu",
          + "gat-4.eu.training.galaxyproject.eu",
          + "gat-5.eu.training.galaxyproject.eu",
          + "gat-6.eu.training.galaxyproject.eu",
          + "gat-7.eu.training.galaxyproject.eu",
          + "gat-8.eu.training.galaxyproject.eu",
          + "gat-9.eu.training.galaxyproject.eu",
          + "gat-10.eu.training.galaxyproject.eu",
          + "gat-11.eu.training.galaxyproject.eu",
          + "gat-12.eu.training.galaxyproject.eu",
          + "gat-13.eu.training.galaxyproject.eu",
          + "gat-14.eu.training.galaxyproject.eu",
          + "gat-15.eu.training.galaxyproject.eu",
          + "gat-16.eu.training.galaxyproject.eu",
          + "gat-17.eu.training.galaxyproject.eu",
          + "gat-18.eu.training.galaxyproject.eu",
          + "gat-19.eu.training.galaxyproject.eu",
          + "gat-20.eu.training.galaxyproject.eu",
          + "gat-21.eu.training.galaxyproject.eu",
          + "gat-22.eu.training.galaxyproject.eu",
          + "gat-23.eu.training.galaxyproject.eu",
          + "gat-24.eu.training.galaxyproject.eu",
          + "gat-25.eu.training.galaxyproject.eu",
          + "gat-26.eu.training.galaxyproject.eu",
          + "gat-27.eu.training.galaxyproject.eu",
          + "gat-28.eu.training.galaxyproject.eu",
          + "gat-29.eu.training.galaxyproject.eu",
          + "gat-30.eu.training.galaxyproject.eu",
          + "gat-31.eu.training.galaxyproject.eu",
          + "gat-32.eu.training.galaxyproject.eu",
          + "gat-33.eu.training.galaxyproject.eu",
          + "gat-34.eu.training.galaxyproject.eu",
          + "gat-35.eu.training.galaxyproject.eu",
          + "gat-36.eu.training.galaxyproject.eu",
          + "gat-37.eu.training.galaxyproject.eu",
          + "gat-38.eu.training.galaxyproject.eu",
          + "gat-39.eu.training.galaxyproject.eu",
        ],
    ]
  ~ training_ips-eu = [
      - [
          - "192.52.42.1",
          - "192.52.46.84",
          - "192.52.43.17",
          - "192.52.46.180",
          - "192.52.45.246",
          - "192.52.46.221",
          - "192.52.45.171",
          - "192.52.45.202",
          - "192.52.42.8",
          - "192.52.42.251",
        ],
      + [
          + "192.52.42.1",
          + "192.52.46.84",
          + "192.52.43.17",
          + "192.52.46.180",
          + "192.52.45.246",
          + "192.52.46.221",
          + "192.52.45.171",
          + "192.52.45.202",
          + "192.52.42.8",
          + "192.52.42.251",
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ],
    ]
  ~ training_pws-eu = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```